src/cf/Documents/уатРекламация_уэ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатРекламация_уэ</Name>
			<BasedOn>
				<xr:Item>Document.уатЗаказГрузоотправителя</xr:Item>
				<xr:Item>Document.уатМаршрутныйЛист</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.уатРекламации_уэ</xr:Item>
				<xr:Item>AccumulationRegister.уатНевыставленныеРекламации_уэ</xr:Item>
				<xr:Item>AccumulationRegister.уатВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.уатРасчетыПоДокументам</xr:Item>
				<xr:Item>AccumulationRegister.уатРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийНомер</Name>
					<Comment>Номер входящего документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКурса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказГрузоотправителя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаршрутныйЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатМаршрутныйЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение организации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатРеализацияУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВыставленная</Name>
					<Comment>Сумма рекламации, которая выставлена контрагентом</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПодтвержденная</Name>
					<Comment>Сумма рекламации, которую подтвердила наша организация</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетСогласования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Распределение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсВзаиморасчетов</Name>
							<Comment>(Общ) Курс валюты взаиморасчетов по договору</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КратностьВзаиморасчетов</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сделка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатРеализацияУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПокупателю</v8:Type>
								<v8:Type>cfg:DocumentRef.уатСчетНаОплатуПоставщика</v8:Type>
								<v8:Type>cfg:DocumentRef.уатПоступлениеТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>Ставка НДС</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>Сумма НДС в валюте регл. учета</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Comment>(Общ) Любая дополнительная информация</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/AccumulationRegisters/уатНевыставленныеРекламации_уэ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>уатНевыставленныеРекламации_уэ</Name>
			<Comment>Невыставленные рекламации (уэ)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказГрузоотправителя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МаршрутныйЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатМаршрутныйЛист</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Enums/ВедениеВзаиморасчетовПоДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВедениеВзаиморасчетовПоДоговорам</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоДоговоруВЦелом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСчетам</Name>
					<Comment>По счетам</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНакладным</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЗаказамНаТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДокументуАрендаТС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатПолучателиУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатПолучателиУслуг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Контрагент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НашаОрганизация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/уатРекламация_уэ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	// Реестр документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор  = "Реестр";
	КомандаПечати.Представление  = НСтр("en='Document register';ru='Реестр документов'");
	КомандаПечати.ЗаголовокФормы = НСтр("en='Register of documents ""Claim""';ru='Реестр документов ""Рекламация""'");
	КомандаПечати.Обработчик     = "уатОбщегоНазначенияТиповыеКлиент.ВыполнитьКомандуПечатиРеестраДокументов";
	КомандаПечати.СписокФорм     = "ФормаСписка";
	КомандаПечати.Порядок        = 100;
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Ложь;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.УправлениеДоступом

// Позволяет переопределить ограничение, указанное в модуле менеджера объекта метаданных.
//
// Параметры:
//  Ограничение - Структура:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                          Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                          Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                          если Истина, тогда не записывать ключи доступа,
//                                          а использовать ключи доступа владельца (требуется,
//                                          чтобы ограничение было строго по объекту-владельцу).
//   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - также
//                                          как у параметра ПоВладельцуБезЗаписиКлючейДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Подразделение)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	СтруктураДополнительныеСвойства.Вставить("МноговалютныйУчет", ПолучитьФункциональнуюОпцию("уатМноговалютныйУчет"));
	СтруктураДополнительныеСвойства.Вставить("ДатаКурса", ?(ДокументСсылка.ДатаКурса = '00010101', ДокументСсылка.Дата, ДокументСсылка.ДатаКурса));
	
	СформироватьТаблицаЗадолженностьКонтрагентов(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРекламации(ДокументСсылка, СтруктураДополнительныеСвойства);
	Если ЗначениеЗаполнено(ДокументСсылка.МаршрутныйЛист) Тогда
		СформироватьТаблицаНевыставленныеРекламации(ДокументСсылка, СтруктураДополнительныеСвойства);
	КонецЕсли;
	СформироватьТаблицаОперативныеРасходы(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаПлатежныйКалендарь(ДокументСсылка, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	Если ЗначениеЗаполнено(ДокументСсылка.ЗаказГрузоотправителя) Тогда
		Заголовок = уатОбщегоНазначенияТиповые.уатПредставлениеДокументаПриПроведении(ДокументСсылка);
		
		мЗапрос = Новый Запрос;
		мЗапрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	уатНевыставленныеРекламации.ЗаказГрузоотправителя,
		|	уатНевыставленныеРекламации.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.уатНевыставленныеРекламации_уэ.Остатки(
		|			&МоментВремени,
		|			ЗаказГрузоотправителя = &Ссылка
		|				И МаршрутныйЛист = &МаршрутныйЛист) КАК уатНевыставленныеРекламации
		|ГДЕ
		|	ЕСТЬNULL(уатНевыставленныеРекламации.КоличествоОстаток, 0) < 0";
		
		мГраницаКонтроля = Новый Граница(ДокументСсылка.МоментВремени(), ВидГраницы.Исключая);
		
		мЗапрос.УстановитьПараметр("Ссылка"        , ДокументСсылка.ЗаказГрузоотправителя);
		мЗапрос.УстановитьПараметр("МаршрутныйЛист", ДокументСсылка.МаршрутныйЛист);
		мЗапрос.УстановитьПараметр("МоментВремени" , мГраницаКонтроля);
		
		Выборка = мЗапрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ТекстНСТР = СтрШаблон(НСтр("en='According to document ""%1"" has already been entered complaint!';ru='По документу ""%1"" уже была введена рекламация!'"), Выборка.ЗаказГрузоотправителя);
			уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстНСТР, Отказ, Заголовок);	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Получает дополнительные реквизиты для отображения в отчете "Реестр документов"
// 
// Возвращаемое значение:
//  Структура - доп. реквизитов
//
Функция ПолучитьДополнительныеРеквизитыДляРеестра() Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("Информация", "Контрагент");
	Результат.Вставить("СуммаДокумента","СуммаПодтвержденная");
	Возврат Результат;
	
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура СформироватьТаблицаЗадолженностьКонтрагентов(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатРекламация_уэРаспределение.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА &МноговалютныйУчет
	|			ТОГДА уатРекламация_уэРаспределение.Валюта
	|		ИНАЧЕ уатРекламация_уэРаспределение.ДоговорКонтрагента.ВалютаВзаиморасчетов
	|	КОНЕЦ КАК Валюта,
	|	уатРекламация_уэРаспределение.Ссылка.Организация КАК Организация,
	|	уатРекламация_уэРаспределение.Контрагент КАК Контрагент,
	|	уатРекламация_уэРаспределение.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	уатРекламация_уэРаспределение.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	уатРекламация_уэРаспределение.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	|	уатРекламация_уэРаспределение.Сделка КАК Сделка,
	|	0 КАК СуммаУпр,
	|	уатРекламация_уэРаспределение.Сумма + ВЫБОР
	|		КОГДА уатРекламация_уэРаспределение.Ссылка.УчитыватьНДС
	|				И НЕ уатРекламация_уэРаспределение.Ссылка.СуммаВключаетНДС
	|			ТОГДА уатРекламация_уэРаспределение.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Сумма,
	|	уатРекламация_уэРаспределение.Ссылка КАК Регистратор,
	|	уатРекламация_уэРаспределение.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения
	|ИЗ
	|	Документ.уатРекламация_уэ.Распределение КАК уатРекламация_уэРаспределение
	|ГДЕ
	|	уатРекламация_уэРаспределение.Ссылка = &Ссылка
	|	И уатРекламация_уэРаспределение.Контрагент ССЫЛКА Справочник.Контрагенты");
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("МноговалютныйУчет", СтруктураДополнительныеСвойства.МноговалютныйУчет);
	
	ТабЗадолженностиКонтрагентов = Запрос.Выполнить().Выгрузить();
	
	ТабЗадолженностиКонтрагентов.Колонки.Добавить("СделкаВрем"); //тип сделки в ТЧ не содержит Заказ на ТС, а он нам нужен
	
	// увеличивается задолженность перевозчика перед нами (уменьшается кредиторская)
	Для каждого ТекСтрока Из ТабЗадолженностиКонтрагентов Цикл
		//ТекСтрока.СуммаУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.Сумма, 
		//	ДокументСсылка.ВалютаДокумента,    СтруктураДополнительныеСвойства.ВалютаУпрУчета,
		//	СтруктураКурсаВалютыДок.Курс,      СтруктураДополнительныеСвойства.КурсУпр,
		//	СтруктураКурсаВалютыДок.Кратность, СтруктураДополнительныеСвойства.КратностьУпр,,
		//	ДокументСсылка);
		
		Если ДокументСсылка.ВалютаДокумента = СтруктураДополнительныеСвойства.ВалютаУпрУчета Тогда
			ТекСтрока.СуммаУпр = ТекСтрока.Сумма;
		Иначе
			ТекСтрока.СуммаУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СуммаВзаиморасчетов, 
				ТекСтрока.Валюта,                  СтруктураДополнительныеСвойства.ВалютаУпрУчета,
				ТекСтрока.КурсВзаиморасчетов,      СтруктураДополнительныеСвойства.КурсУпр,
				ТекСтрока.КратностьВзаиморасчетов, СтруктураДополнительныеСвойства.КратностьУпр,,
				ДокументСсылка);
		КонецЕсли;
												
		Если ТекСтрока.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом
			ИЛИ НЕ ЗначениеЗаполнено(ТекСтрока.ДоговорКонтрагента.ВедениеВзаиморасчетов) Тогда
			ТекСтрока.Сделка = Неопределено;	
		КонецЕсли;
		
		ТекСтрока.СделкаВрем = ТекСтрока.Сделка;
	КонецЦикла;
	
	// уменьшается задолженность заказчика перед нами (уменьшается дебиторская)
	Если ТипЗнч(ДокументСсылка.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
		НовСтрока = ТабЗадолженностиКонтрагентов.Добавить();
		НовСтрока.Период = ДокументСсылка.Дата;
		НовСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
		НовСтрока.ДоговорКонтрагента = ДокументСсылка.ДоговорКонтрагента;
		НовСтрока.Валюта             = ДокументСсылка.ДоговорКонтрагента.ВалютаВзаиморасчетов;
		НовСтрока.Организация        = ДокументСсылка.Организация;
		НовСтрока.Контрагент         = ДокументСсылка.Контрагент;
		Если ДокументСсылка.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС Тогда
			НовСтрока.СделкаВрем     = ДокументСсылка.ЗаказГрузоотправителя;
		ИначеЕсли ДокументСсылка.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным
			ИЛИ ДокументСсылка.ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам Тогда
			НовСтрока.СделкаВрем     = ДокументСсылка.Сделка;
		КонецЕсли;
		
		НовСтрока.СуммаВзаиморасчетов = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ДокументСсылка.СуммаПодтвержденная,
			ДокументСсылка.ВалютаДокумента, ДокументСсылка.ДоговорКонтрагента.ВалютаВзаиморасчетов,
			СтруктураДополнительныеСвойства.ДатаКурса, СтруктураДополнительныеСвойства.ДатаКурса,,,,
			ДокументСсылка);
			
		НовСтрока.СуммаУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ДокументСсылка.СуммаПодтвержденная, 
			ДокументСсылка.ВалютаДокумента, СтруктураДополнительныеСвойства.ВалютаУпрУчета,
			СтруктураДополнительныеСвойства.ДатаКурса, СтруктураДополнительныеСвойства.КурсУпр,
			, СтруктураДополнительныеСвойства.КратностьУпр,,
			ДокументСсылка);
	КонецЕсли;
	
	ТабЗадолженностиКонтрагентов.Колонки.Удалить("Сделка");
	ТабЗадолженностиКонтрагентов.Колонки.СделкаВрем.Имя = "Сделка";
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВзаиморасчетов", ТабЗадолженностиКонтрагентов);
КонецПроцедуры

Процедура СформироватьТаблицаРекламации(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатРекламация_уэРаспределение.Контрагент КАК Виновник,
	|	уатРекламация_уэРаспределение.СтатьяРасходов КАК СтатьяРасходов,
	|	уатРекламация_уэРаспределение.Ссылка.Контрагент КАК Контрагент,
	|	уатРекламация_уэРаспределение.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	уатРекламация_уэРаспределение.Ссылка.ЗаказГрузоотправителя КАК ЗаказГрузоотправителя,
	|	уатРекламация_уэРаспределение.Сумма + ВЫБОР
	|		КОГДА уатРекламация_уэРаспределение.Ссылка.УчитыватьНДС
	|				И НЕ уатРекламация_уэРаспределение.Ссылка.СуммаВключаетНДС
	|			ТОГДА уатРекламация_уэРаспределение.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Сумма,
	|	0 КАК СуммаУпр,
	|	0 КАК СуммаРегл,
	|	уатРекламация_уэРаспределение.Ссылка.Дата КАК Период,
	|	уатРекламация_уэРаспределение.Ссылка.МаршрутныйЛист КАК МаршрутныйЛист
	|ИЗ
	|	Документ.уатРекламация_уэ.Распределение КАК уатРекламация_уэРаспределение
	|ГДЕ
	|	уатРекламация_уэРаспределение.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	мТаб = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ТекСтрока Из мТаб Цикл
		ТекСтрока.СуммаРегл = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.Сумма,
			ДокументСсылка.ВалютаДокумента,    СтруктураДополнительныеСвойства.ВалютаРеглУчета,
			ДокументСсылка.КурсДокумента,      СтруктураДополнительныеСвойства.КурсРегл,
			ДокументСсылка.КратностьДокумента, СтруктураДополнительныеСвойства.КратностьРегл,,
			ДокументСсылка);
			
		ТекСтрока.СуммаУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.Сумма,
			ДокументСсылка.ВалютаДокумента,    СтруктураДополнительныеСвойства.ВалютаУпрУчета,
			ДокументСсылка.КурсДокумента,      СтруктураДополнительныеСвойства.КурсУпр,
			ДокументСсылка.КратностьДокумента, СтруктураДополнительныеСвойства.КратностьУпр,,
			ДокументСсылка);
	КонецЦикла;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРекламации", мТаб);
КонецПроцедуры

Процедура СформироватьТаблицаНевыставленныеРекламации(ДокументСсылка, СтруктураДополнительныеСвойства)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	уатРекламация_уэ.Ссылка КАК Регистратор,
	|	уатРекламация_уэ.Дата КАК Период,
	|	уатРекламация_уэ.ЗаказГрузоотправителя,
	|	1 КАК Количество,
	|	уатРекламация_уэ.МаршрутныйЛист
	|ИЗ
	|	Документ.уатРекламация_уэ КАК уатРекламация_уэ
	|ГДЕ
	|	уатРекламация_уэ.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	тблДвижения = Запрос.Выполнить().Выгрузить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНевыставленныеРекламации", тблДвижения);
КонецПроцедуры

Процедура СформироватьТаблицаОперативныеРасходы(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатРекламация_уэРаспределение.Ссылка КАК Регистратор,
	|	уатРекламация_уэРаспределение.Ссылка.Дата КАК Период,
	|	уатРекламация_уэРаспределение.Ссылка.ЗаказГрузоотправителя КАК Заказ,
	|	уатРекламация_уэРаспределение.Ссылка.ЗаказГрузоотправителя.Ответственный КАК Менеджер,
	|	ВЫБОР
	|		КОГДА уатРекламация_уэРаспределение.Ссылка.ЗаказГрузоотправителя = ЗНАЧЕНИЕ(Документ.уатЗаказГрузоотправителя.ПустаяСсылка)
	|			ТОГДА уатРекламация_уэРаспределение.Ссылка.МаршрутныйЛист.Маршрут
	|		ИНАЧЕ уатРекламация_уэРаспределение.Ссылка.ЗаказГрузоотправителя.Маршрут
	|	КОНЕЦ КАК Маршрут,
	|	ВЫБОР
	|		КОГДА уатРекламация_уэРаспределение.Ссылка.ЗаказГрузоотправителя = ЗНАЧЕНИЕ(Документ.уатЗаказГрузоотправителя.ПустаяСсылка)
	|			ТОГДА уатРекламация_уэРаспределение.Ссылка.МаршрутныйЛист.ОбъектСтроительства
	|		ИНАЧЕ уатРекламация_уэРаспределение.Ссылка.ЗаказГрузоотправителя.ОбъектСтроительства
	|	КОНЕЦ КАК ОбъектСтроительства,
	|	ВЫБОР
	|		КОГДА уатРекламация_уэРаспределение.Ссылка.ЗаказГрузоотправителя = ЗНАЧЕНИЕ(Документ.уатЗаказГрузоотправителя.ПустаяСсылка)
	|			ТОГДА уатРекламация_уэРаспределение.Ссылка.МаршрутныйЛист.ВидПеревозки
	|		ИНАЧЕ уатРекламация_уэРаспределение.Ссылка.ЗаказГрузоотправителя.ВидПеревозки
	|	КОНЕЦ КАК ВидПеревозки,
	|	ВЫБОР
	|		КОГДА уатРекламация_уэРаспределение.Ссылка.ЗаказГрузоотправителя = ЗНАЧЕНИЕ(Документ.уатЗаказГрузоотправителя.ПустаяСсылка)
	|			ТОГДА уатРекламация_уэРаспределение.Ссылка.МаршрутныйЛист.НаправлениеПеревозки
	|		ИНАЧЕ уатРекламация_уэРаспределение.Ссылка.ЗаказГрузоотправителя.НаправлениеПеревозки
	|	КОНЕЦ КАК НаправлениеПеревозки,
	|	ВЫБОР
	|		КОГДА уатРекламация_уэРаспределение.Ссылка.Подразделение <> ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	|			ТОГДА уатРекламация_уэРаспределение.Ссылка.Подразделение
	|		КОГДА уатРекламация_уэРаспределение.Ссылка.ЗаказГрузоотправителя = ЗНАЧЕНИЕ(Документ.уатЗаказГрузоотправителя.ПустаяСсылка)
	|			ТОГДА уатРекламация_уэРаспределение.Ссылка.МаршрутныйЛист.Подразделение
	|		ИНАЧЕ уатРекламация_уэРаспределение.Ссылка.ЗаказГрузоотправителя.Подразделение
	|	КОНЕЦ КАК Подразделение,
	|	уатРекламация_уэРаспределение.Ссылка.МаршрутныйЛист.ТС КАК ТС,
	|	уатРекламация_уэРаспределение.Ссылка.Контрагент КАК Контрагент,
	|	уатРекламация_уэРаспределение.Ссылка.ДоговорКонтрагента КАК Договор,
	|	уатРекламация_уэРаспределение.Ссылка.Организация КАК Организация,
	|	уатРекламация_уэРаспределение.СтатьяРасходов КАК СтатьяРасходов,
	|	1 КАК Количество,
	|	уатРекламация_уэРаспределение.Сумма КАК Сумма,
	|	уатРекламация_уэРаспределение.СуммаНДС КАК СуммаНДС,
	|	уатРекламация_уэРаспределение.СуммаНДС КАК СуммаНДСУпр,
	|	0 КАК СуммаРегл,
	|	0 КАК СуммаУпр
	|ИЗ
	|	Документ.уатРекламация_уэ.Распределение КАК уатРекламация_уэРаспределение
	|ГДЕ
	|	уатРекламация_уэРаспределение.Ссылка = &Ссылка
	|	И (уатРекламация_уэРаспределение.Контрагент = уатРекламация_уэРаспределение.Ссылка.Организация
	|			ИЛИ уатРекламация_уэРаспределение.Контрагент ССЫЛКА Справочник.ФизическиеЛица)");
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	ТаблицаРасходы = Запрос.Выполнить().Выгрузить();
	
	// заполнение колонны ТС
	Если ЗначениеЗаполнено(ДокументСсылка.МаршрутныйЛист) И ЗначениеЗаполнено(ДокументСсылка.МаршрутныйЛист.ТС) Тогда
		СтруктураМестоТС = уатОбщегоНазначения.МестонахождениеТС(ДокументСсылка.МаршрутныйЛист.ТС, ДокументСсылка.МаршрутныйЛист.Дата);
		Если ЗначениеЗаполнено(СтруктураМестоТС.Колонна) Тогда
			ТаблицаРасходы.Колонки.Добавить("Колонна");
			ТаблицаРасходы.ЗаполнитьЗначения(СтруктураМестоТС.Колонна, "Колонна");
		КонецЕсли;
	КонецЕсли;
		
	КурсДокумента = уатОбщегоНазначенияТиповые.уатКурсДокумента(ДокументСсылка, СтруктураДополнительныеСвойства.ВалютаРеглУчета);
	КратностьДокумента = уатОбщегоНазначенияТиповые.уатКратностьДокумента(ДокументСсылка, СтруктураДополнительныеСвойства.ВалютаРеглУчета);
	
	Для Каждого ТекСтрока Из ТаблицаРасходы Цикл
		СуммаВсего = ТекСтрока.Сумма + ?(ДокументСсылка.УчитыватьНДС И НЕ ДокументСсылка.СуммаВключаетНДС, ТекСтрока.СуммаНДС, 0);
		
		ТекСтрока.СуммаУпр  = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(СуммаВсего,
			ДокументСсылка.ВалютаДокумента, СтруктураДополнительныеСвойства.ВалютаУпрУчета,
			КурсДокумента,                  СтруктураДополнительныеСвойства.КурсУпр,
			КратностьДокумента,             СтруктураДополнительныеСвойства.КратностьУпр,,
			ДокументСсылка);
									
		ТекСтрока.СуммаРегл = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(СуммаВсего,
			ДокументСсылка.ВалютаДокумента, СтруктураДополнительныеСвойства.ВалютаРеглУчета,
			КурсДокумента,                  СтруктураДополнительныеСвойства.КурсРегл,
			КратностьДокумента,             СтруктураДополнительныеСвойства.КратностьРегл,,
			ДокументСсылка);
									
		ТекСтрока.СуммаНДС = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СуммаНДС,
			ДокументСсылка.ВалютаДокумента, СтруктураДополнительныеСвойства.ВалютаРеглУчета,
			КурсДокумента,                  СтруктураДополнительныеСвойства.КурсРегл,
			КратностьДокумента,             СтруктураДополнительныеСвойства.КратностьРегл,,
			ДокументСсылка);
			
		ТекСтрока.СуммаНДСУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СуммаНДСУпр,
			ДокументСсылка.ВалютаДокумента, СтруктураДополнительныеСвойства.ВалютаУпрУчета,
			КурсДокумента,                  СтруктураДополнительныеСвойства.КурсУпр,
			КратностьДокумента,             СтруктураДополнительныеСвойства.КратностьУпр,,
			ДокументСсылка);
	КонецЦикла;
	
	уатРасчетыПоТарифам_уэ.РаспределитьДоходыРасходыМеждуЗаказами(ТаблицаРасходы);
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасходы", ТаблицаРасходы);
	
КонецПроцедуры

Процедура СформироватьТаблицаПлатежныйКалендарь(ДокументСсылка, СтруктураДополнительныеСвойства)
	// уменьшается задолженность заказчика перед нами (уменьшается дебиторская)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатРекламация_уэ.Дата КАК Период,
	|	уатРекламация_уэ.Ссылка КАК Регистратор,
	|	уатРекламация_уэ.Организация КАК Организация,
	|	уатРекламация_уэ.Контрагент КАК Контрагент,
	|	уатРекламация_уэ.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА уатРекламация_уэ.ДоговорКонтрагента.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС)
	|			ТОГДА уатРекламация_уэ.ЗаказГрузоотправителя
	|		ИНАЧЕ уатРекламация_уэ.Сделка
	|	КОНЕЦ КАК Сделка,
	|	уатРекламация_уэ.ЗаказГрузоотправителя КАК ЗаказНаТС,
	|	уатРекламация_уэ.ВалютаДокумента КАК Валюта,
	|	уатРекламация_уэ.КурсДокумента КАК Курс,
	|	уатРекламация_уэ.КратностьДокумента КАК Кратность,
	|	ЗНАЧЕНИЕ(Перечисление.уатПолучателиУслуг.Контрагент) КАК ПолучательУслуг,
	|	уатРекламация_уэ.СуммаПодтвержденная КАК СуммаРасход,
	|	уатРекламация_уэ.СуммаПодтвержденная КАК СуммаРасходУпр
	|ИЗ
	|	Документ.уатРекламация_уэ КАК уатРекламация_уэ
	|ГДЕ
	|	уатРекламация_уэ.Ссылка = &Ссылка
	|	И (уатРекламация_уэ.ДоговорКонтрагента.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам)
	|			ИЛИ уатРекламация_уэ.ДоговорКонтрагента.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным)
	|			ИЛИ уатРекламация_уэ.ДоговорКонтрагента.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС))
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	уатРекламация_уэРаспределение.Ссылка.Дата,
	|	уатРекламация_уэРаспределение.Ссылка,
	|	уатРекламация_уэРаспределение.Ссылка.Организация,
	|	уатРекламация_уэРаспределение.Контрагент,
	|	уатРекламация_уэРаспределение.ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА уатРекламация_уэРаспределение.Ссылка.ДоговорКонтрагента.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС)
	|			ТОГДА уатРекламация_уэРаспределение.Ссылка.ЗаказГрузоотправителя
	|		ИНАЧЕ уатРекламация_уэРаспределение.Сделка
	|	КОНЕЦ,
	|	уатРекламация_уэРаспределение.Ссылка.ЗаказГрузоотправителя,
	|	ВЫБОР
	|		КОГДА &МноговалютныйУчет
	|			ТОГДА уатРекламация_уэРаспределение.Валюта
	|		ИНАЧЕ уатРекламация_уэРаспределение.ДоговорКонтрагента.ВалютаВзаиморасчетов
	|	КОНЕЦ,
	|	уатРекламация_уэРаспределение.КурсВзаиморасчетов,
	|	уатРекламация_уэРаспределение.КратностьВзаиморасчетов,
	|	ЗНАЧЕНИЕ(Перечисление.уатПолучателиУслуг.НашаОрганизация),
	|	уатРекламация_уэРаспределение.Сумма + ВЫБОР
	|		КОГДА уатРекламация_уэРаспределение.Ссылка.УчитыватьНДС
	|				И НЕ уатРекламация_уэРаспределение.Ссылка.СуммаВключаетНДС
	|			ТОГДА уатРекламация_уэРаспределение.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	уатРекламация_уэРаспределение.Сумма + ВЫБОР
	|		КОГДА уатРекламация_уэРаспределение.Ссылка.УчитыватьНДС
	|				И НЕ уатРекламация_уэРаспределение.Ссылка.СуммаВключаетНДС
	|			ТОГДА уатРекламация_уэРаспределение.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	Документ.уатРекламация_уэ.Распределение КАК уатРекламация_уэРаспределение
	|ГДЕ
	|	уатРекламация_уэРаспределение.Ссылка = &Ссылка
	|	И уатРекламация_уэРаспределение.Контрагент ССЫЛКА Справочник.Контрагенты
	|	И (уатРекламация_уэРаспределение.ДоговорКонтрагента.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам)
	|			ИЛИ уатРекламация_уэРаспределение.ДоговорКонтрагента.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным)
	|			ИЛИ уатРекламация_уэРаспределение.ДоговорКонтрагента.ВедениеВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС))");
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("МноговалютныйУчет", СтруктураДополнительныеСвойства.МноговалютныйУчет);
	
	ТаблицаПлатежныйКалендарь = Запрос.Выполнить().Выгрузить();
	
	Если ДокументСсылка.ВалютаДокумента <> СтруктураДополнительныеСвойства.ВалютаУпрУчета Тогда
		СтруктураКурсаВзаиморасчетов = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(ДокументСсылка.ДоговорКонтрагента.ВалютаВзаиморасчетов,
			СтруктураДополнительныеСвойства.ДатаКурса, ДокументСсылка);
	    Для каждого ТекСтрока Из ТаблицаПлатежныйКалендарь Цикл
			ТекСтрока.СуммаРасходУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СуммаРасходУпр,
				ТекСтрока.Валюта,    СтруктураДополнительныеСвойства.ВалютаУпрУчета,
				ТекСтрока.Курс,      СтруктураДополнительныеСвойства.КурсУпр,
				ТекСтрока.Кратность, СтруктураДополнительныеСвойства.КратностьУпр,,
				ДокументСсылка);
		КонецЦикла;	
	КонецЕсли;
	
	ТаблицаПлатежныйКалендарь.Свернуть("Период, Регистратор, Организация, Контрагент, ДоговорКонтрагента, Сделка, ЗаказНаТС, Валюта, ПолучательУслуг", "СуммаРасход, СуммаРасходУпр");
	уатПроведение_проф.РаспределитьПлатежныйКалендарьПоГрафикуОплаты(ТаблицаПлатежныйКалендарь, ДокументСсылка);
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПлатежныйКалендарь", ТаблицаПлатежныйКалендарь);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
